HELYXcore-4.4.0/examples/legacy/incompressible/overSimpleFoam/aeroFoil/background_overset/0.orig/include/frontBackTopBottomfreePatches
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/

topAndBottom
{
    type slip;
}

// ************************************************************************* //
