HELYXcore-4.4.0/examples/legacy/incompressible/overSimpleFoam/aeroFoil/background_overset/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform $turbulentKE;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    wall
    {
        type            kqRWallFunction;
        value           uniform 0;
    }

    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;       // 5% turbulent intensity
        value           $internalField;
    }

    outlet
    {
       type             inletOutlet;
       inletValue       $internalField;
       value            $internalField;
    }

    #include "include/frontBackTopBottomfreePatches"
}

// ************************************************************************* //
