HELYXcore-4.4.0/examples/legacy/incompressible/overSimpleFoam/aeroFoil/background_overset/Allrun.pre
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

runApplication extrudeMesh -overwrite
runApplication createPatch -overwrite
mergeMeshes . ../aeroFoil_overset -overwrite > log.mergeMeshes
runApplication topoSet

restore0Dir

# Use cellSets to write zoneID
runApplication setFields

#------------------------------------------------------------------------------
