HELYXcore-4.4.0/examples/legacy/incompressible/overSimpleFoam/aeroFoil/background_overset/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-1.0 -1.0 -0.1)
    ( 2.0 -1.0 -0.1)
    ( 2.0 1.0 -0.1)
    (-1.0 1.0 -0.1)
    (-1.0 -1.0  0.1)
    ( 2.0 -1.0  0.1)
    ( 2.0 1.0  0.1)
    (-1.0 1.0  0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (17 11 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    topAndBottom
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    symFront
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }

    symBack
    {
        type symmetryPlane;
        faces
        (
            (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
